app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-03-13 12:15:28.684132"], ["updated_at", "2019-03-13 12:15:28.684132"]]